path = input('Введіть шлях до файлу, який хочете вікрити: ')

file = open(path)

print('\nВміст файлу:')
print(file.read())

'''
    Додати обробку виключень під час виконання команди open.
    У випадку, якщо введений файл не знайдено, попросити 
    користувача ввести шлях до файлу ще раз і повторювати
    до тих пір, доки не буде введено існуючий файл.
    
    За можливості додати обробку інших помилок функції open.
    
    В разі, якщо файл виявився пустим - згенерувати вийняток
    типу ValueError або RuntimeError (на свій вибір)
'''